tutorials/floatRigidBody/floatRigidBody_monolithic_gravity/0.orig/beamone/Gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      Gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(0.000458702275253 -3.58848551599e-18 -1.21872308317e-05)
(0.000459501654778 -2.77400679467e-18 -9.41774786642e-06)
(0.000460302178277 -2.14116580058e-18 -7.26477999127e-06)
(0.00046110515564 -1.64961979889e-18 -5.59140985617e-06)
(0.000461911366786 -1.26787356637e-18 -4.29103078594e-06)
(0.000462721271903 -9.71363392988e-19 -3.28065308027e-06)
(0.000463535138442 -7.40934139262e-19 -2.49568198058e-06)
(0.000464353117767 -5.61710720576e-19 -1.88584512826e-06)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-0.000457901852413 -3.39194685829e-13 1.57490324742e-05);
    }
    right
    {
        type            calculated;
        value           uniform (0.000492661839828 -3.39195032763e-13 1.45696638894e-05);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
