tutorials/floatRigidBody/floatRigidBody_monolithic_gravity/0.orig/beamone/M
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      M;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
39
(
(2.10947901538e-22 -4.61650523378e-07 -3.81200681382e-22)
(3.62863390616e-22 -8.18675197684e-07 -6.52288235856e-22)
(4.65087722763e-22 -1.09435542766e-06 -8.31746120473e-22)
(5.23129990292e-22 -1.30680478118e-06 -9.307796044e-22)
(5.41727327701e-22 -1.47011250378e-06 -9.58971712454e-22)
(5.26331948731e-22 -1.59523469733e-06 -9.26957776312e-22)
(4.83738054394e-22 -1.69068858456e-06 -8.47495089279e-22)
(4.21724921719e-22 -1.76309317617e-06 -7.34786499111e-22)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-8.15999712199e-37 6.13336342519e-38 1.22926355112e-37);
    }
    right
    {
        type            calculated;
        value           uniform (7.77952608908e-38 1.32098200485e-37 -5.21234886567e-37);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
