tutorials/floatRigidBody/floatRigidBody_monolithic_gravity/0.orig/beamone/pointW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "2";
    object      pointW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
1312
(
(0.250488846214 0.025 -0.149872369978)
(0.250479453171 0.025 -0.149874822353)
(0.250451635012 0.025 -0.149882085235)
(0.250406460772 0.025 -0.149893879515)
(0.250345666473 0.025 -0.149909751946)
(0.250271588405 0.025 -0.149929092559)
(0.250187073347 0.025 -0.149951158105)
(0.250095369165 0.025 -0.149975100618)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
