tutorials/floatRigidBody/floatRigidBody_monolithic_gravity/0.orig/beamone/refW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      refW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
40
(
(0.249551880897 0.025 -0.148437500002)
(0.24865564269 0.025 -0.145312500006)
(0.247759404484 0.025 -0.14218750001)
(0.246863166278 0.025 -0.139062500014)
(0.245966928071 0.025 -0.135937500018)
(0.245070689865 0.025 -0.132812500022)
(0.244174451658 0.025 -0.129687500026)
(0.243278213452 0.025 -0.12656250003)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.25 0.025 -0.15);
    }
    right
    {
        type            calculated;
        value           uniform (0.214150471744 0.025 -0.0250000001597);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
