tutorials/floatRigidBody/floatRigidBody_monolithic_gravity/0.orig/beamone/refWf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "0";
    object      refWf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
39
(
(0.249103761794 0.025 -0.146875000004)
(0.248207523587 0.025 -0.143750000008)
(0.247311285381 0.025 -0.140625000012)
(0.246415047174 0.025 -0.137500000016)
(0.245518808968 0.025 -0.13437500002)
(0.244622570762 0.025 -0.131250000024)
(0.243726332555 0.025 -0.128125000028)
(0.242830094349 0.025 -0.125000000032)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.25 0.025 -0.15);
    }
    right
    {
        type            calculated;
        value           uniform (0.214150471744 0.025 -0.0250000001597);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
